#Groupby

Groupby possibilita você agrupar linhas baseado nas partições e a partir de uma função, agregar os valores

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
df.groupby('Company') #.groupby agregando os valores dentro de 'Company'

In [7]:
byComp = df.groupby('Company') #byComp recebendo o valor de df.groupby('Company)

In [8]:
byComp

In [9]:
byComp.mean() #groupby está dentro da variavel byComp, nesse caso agrupou todas as partições iguais e retornou a média (.mean) de cada uma delas
#não é exibido a 'Person' pois é possivel conseguir média de strings, então automaticamente é ignorado

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
byComp.sum() #somando os valores de cada partição

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [11]:
byComp.std() #desvio de padrão **estudar mais**

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [12]:
byComp.sum().loc['FB'] #localizando o valor das somas da linha 'FB'

Sales    593
Name: FB, dtype: int64

In [13]:
df.groupby('Company').sum().loc['FB'] #mesmo exemplo acima, porém, mostrando todo o caminho

Sales    593
Name: FB, dtype: int64

In [14]:
df.groupby('Company').count() #.count retorna a quantidade de elementos
#nesse caso 'Person' aparece pois está sendo contado quantas pessoas está em cada Company. Em sales exibe quantas sales tem em cada Company

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [15]:
df.groupby('Company').max() #exibindo quem fez o maior valor de cada Company

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [16]:
df.groupby('Company').min() #exibindo quem fez o menor valor de cada Company

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [18]:
df.groupby('Company').describe() #.describe exibe os valores da média, desvio de padrão, mínimo, 25%,50%,75% e o valor maximo

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
df.groupby('Company').describe().transpose() #.transpose reflete a posição das linhas e colunas vice-versa

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [20]:
df.groupby('Company').describe().transpose()['FB'] #exibindo apenas a coluna de FB

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64